fn main() {
    // целое число со знаком и занимает в памяти 8 бит (диапазон значений от -128 до 127)
    let my_var_i8: i8 = 127;
    println!("Значение переменной my_var_i8: {}", my_var_i8);

    // хранит положительное целое число и занимает в памяти 8 бит (диапазон значений от 0 до 255)
    let my_var_u8: u8 = 255;
    println!("Значение переменной my_var_u8: {}", my_var_u8);

    // хранит целое число со знаком и занимает в памяти 16 бит (от -32 768 до 32 767)
    let my_var_i16: i16 = 32_767;
    println!("Значение переменной my_var_i16: {}", my_var_i16);

    // хранит положительное целое число и занимает в памяти 16 бит (от 0 до 65 535)
    let my_var_u16: u16 = 65_535;
    println!("Значение переменной my_var_u16: {}", my_var_u16);

    // хранит целое число со знаком и занимает в памяти 32 бита (от -2 147 483 648 до 2 147 483 647)
    let my_var_i32: i32 = 2_147_483_647;
    println!("Значение переменной my_var_i32: {}", my_var_i32);

    // хранит положительное целое число и занимает в памяти 32 бита (от 0 до 4 294 967 295)
    let my_var_u32: u32 = 4_294_967_295;
    println!("Значение переменной my_var_u32: {}", my_var_u32);

    // целое число со знаком и занимает в памяти 64 бита (от -9,223,372,036,854,775,808 до 9,223,372,036,854,775,807)
    let my_var_i64: i64 = 0;
    println!("Значение переменной my_var_i64: {}", my_var_i64);

    // положительное целое число и занимает в памяти 64 бита (от 0 до 18 446 744 073 709 551 615)
    let my_var_u64: u64 = 0;
    println!("Значение переменной my_var_u64: {}", my_var_u64);

    // целое число со знаком и занимает в памяти 128 бит (примерно от -1.7 * 10^38 до +1.7 * 10^38)
    let my_var_i128: i128 = 0;
    println!("Значение переменной my_var_i128: {}", my_var_i128);

    // положительное целое число и занимает в памяти 128 бит (от 0 до где-то 3.4 * 10^38)
    let my_var_u128: u128 = 0;
    println!("Значение переменной my_var_u128: {}", my_var_u128);

    // целое число со знаком, размерность которого зависит от архитектуры компьютера -
    // 64 бита на 64-битной архитектуре (от -263 до 263 – 1),
    // и 32 бита на 32-битной архитектуре (от -231 до 231 - 1)
    let var_isize: isize = 0;
    println!("var_isize: {}", var_isize);

    // положительное целое число, размерность которого зависит от архитектуры компьютера -
    // 64 бита на 64-битной архитектуре (от 0 до 2^64-1),
    // и 32 бита на 32-битной архитектуре (от 0 до 2^32-1)
    let var_usize: usize = 0;
    println!("var_usize: {}", var_usize);

    let a: f32 = 2.04;
    println!("a: {}", a);

    let b: f64 = 100.080973;
    println!("b: {}", b);

    let c = -45.78; // тип f64
    println!("c: {}", c);

    let a: bool = true;
    println!("a: {}", a);

    let b = false;
    println!("b: {}", b);

    let a: char = 'a'; // Символьный тип
    println!("a: {}", a);

    let b = 'b'; // тип char
    println!("b: {}", b);

    let ni = '你';
    println!("ni: {}", ni); // ni: 你

    let smile = '\u{1F601}';
    println!("smile: {}", smile); // smile: 😁

    // Строки не относятся к примитивным типам
    let a: &str = "hello";
    println!("a: {}", a);
    let b = "Rust"; // тип &str
    println!("b: {}", b);

    // Изменяемая переменная
    let mut mut_vat: u32 = 22;
    mut_vat = mut_vat + 1;
    println!("mut_vat = {mut_vat}");
}
