fn main() {
    println!("Сейчас будем двигать разряды");

    let mut mask = 0b0000_0001;
    println!("mask = 0b{:b}", mask);

    mask <<= 1; // сдвиг влево на 1 бит с присвоением
    println!("mask = 0b{:b}", mask);

    let a = 2 | 5; // поразрядное ИЛИ 010|101=1111
    println!("a = 0b{:b}", a);
    println!("a = {}", a);

    let b = 6 & 2; // поразрядное И 110 & 010 = 10
    println!("b = {}", b);

    let c = 6 ^ 2; // поразрядное исключающее ИЛИ 110 ^ 010 = 100
    println!("c = {}", c);

    let mut d = 0b0000_0010;
    d |= 0b0000_0001; // поразрядное ИЛИ с присвоением, установка бита по сути
    println!("e = 0b{:b}", d);

    let mut e = 0b0000_0011;
    e &= 0b1111_1110; // поразрядное И с присвоением, сброс бита по сути

    println!("e = 0b{:b}", e);
}
